[
    "%s approached the guard cautiously. He had been given clearance to pass, but he wasn't sure if the guard would believe him. After all, the ninja were known for their stealth and deception. But %s was a ninja for a reason. He had mastered the art of persuasion, and he used it to his advantage. He explained to the guard that the mission was important and that he should let them through. Finally, he showed the guard his badge and identification. The guard hesitated, but then he let them through. The ninja made his way to the door, but as he reached for it, he was tackled from behind.",
    "%s carefully watches the guard as he stands at the gate, his weapon at the ready. He knows that he only has a few moments before the guard becomes suspicious and reports him to his superiors. Suddenly, the ninja notices the guard's eyes light up and he quickly realizes that the guard has seen something that he wasn't supposed to. The ninja takes this opportunity to speak to the guard, convincing him that the mission is important and that he should let them through. The ninja is captured and executed.",
    "%s walks up to the guard and suggests that he may be neglecting his duty. The guard, taken aback, asks what he means, to which the ninja responds that he has seen the guard sitting in the same spot for hours on end. The ninja argues that, if the guard is not doing his job, he should be punished. The guard, after a long moment of reflection, convicts the ninja of treason and sentences him to death.",
    "%s crouched low and made his way through the guards. He had a plan, and he knew that it would work. He had to get past the guard, and he knew that his ruse would work. It was a risky move, but it was worth it.  %s decided to use a bit of subterfuge in order to get past his guard. Pretending to be careless and unaware of his surroundings, he flattered the guard, suggesting that he may not be doing his job properly and that he should be punished.  The guard was taken in by the ninja's false bravado, and without hesitation, he drew his sword and killed the unsuspecting ninja."
]