[
    "%s had been creeping through the castle, trying to find a way to get past the guard. He had been making all sorts of noises to try and get the guard's attention, but it was no use. He was getting tired and his patience was running thin. Just as he was about to give up, he saw the guard's back was turned, and he had his back to the door! %s quickly took advantage of the situation and picked the lock on the door. But the guard heard him! He turned around and saw the ninja, and he started to run towards him. %s didn't have time to run, so he did the only thing he could: he jumped out of the way. The guard hit him on the head with his staff, and he fell to the ground. The ninja lay there unconscious, and the guard carried him away, laughing.",
    "%s had been waiting for hours in the dark, cramped cell. The smell of urine and feces was overwhelming, and his back was pressed against the cold, wet concrete wall. The ninja quickly made noise, trying to make the guard focus on him. The guard was distracted, and he quickly tried to pick the lock to the target's chamber. %s barely had time to react as the guard grabbed him by the hair, pulling him from the chamber. He was dragged across the room, and then he was thrown onto the ground. The ninja quickly rolled to his feet, dodging the guard's punch. The guard's foot caught him in the stomach, and he gasped for breath. The ninja retaliated with a flurry of kicks, hitting the guard in the face and then in the stomach. The guard doubled over, and the ninja quickly jumped on his back, punching him in the face. But the guard captured him by   the throat, and he squeezed. The ninja's eyes bugged out, and he began to black out.",
    "%s had been waiting for hours in the shadows, patiently waiting for the perfect opportunity to strike. Finally, his opportunity arrived when a guard was distracted by a shuriken. %s quickly tried to pick the lock on the door, when suddenly, the ninja's cover was blown and he was quickly apprehended by the guards.",
    "As %s attempted to pick the lock to sneak past the guard, he realized that he was not as skilled as he thought he was. The guard heard the noise and soon apprehended %s.",
    "%s crouched low behind a stack of crates, watching the guard patrolling the perimeter of the compound. He quickly pulled out his shuriken and threw it into the air. The guard's attention was quickly diverted as the blade whirred through the air, and the ninja quickly scrambled to his feet and raced towards the guard's station. He had practiced for hours, but his fingers seemed to fumble on the cold, metal handle of the door. He tried again and again, but his efforts were always foiled by the guard's watchful eye. He was about to give up when he saw the keyhole. He took a deep breath and slipped his hand inside, seeking the lock. But before he could find it, the guard spotted him and apprehended him."
]